app/controllers/torneos_controller.rb

SELECT  "torneos".* FROM "torneos"  WHERE (cantidad_fechas = '3')  ORDER BY id LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "torneos"  WHERE (cantidad_fechas = '3')
---

	    if cond.size > 0

	      @torneos =  Torneo.orden_01.where(cond).paginate(per_page: 10, page: params[:page])

SELECT  "torneos".* FROM "torneos"   ORDER BY id LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "torneos"
---

	    else

	      @torneos = Torneo.orden_01.paginate(per_page: 10, page: params[:page])

INSERT INTO "torneos" ("created_at", "descripcion", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2022-01-11 02:17:38.100945"], ["descripcion", "CAMPEONATO TAPAICUA"], ["updated_at", "2022-01-11 02:17:38.100945"]]
---
	  def guardar

	    valido = true
	    @msg = ""

	    @torneo = Torneo.new()

	    @torneo.descripcion = params[:torneo][:descripcion].upcase
	  	@torneo.cantidad_fechas = params[:torneo][:cantidad_fechas]
	  	@torneo.fecha = params[:torneo][:fecha]

	      if @torneo.save

SELECT  "torneos".* FROM "torneos"  WHERE "torneos"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "torneos" WHERE "torneos"."id" = $1  [["id", 1]]
---
	  def eliminar

	    valido = true
	    @msg = ""

	    @torneo = Torneo.find(params[:id])
		@torneo_elim = @torneo

	    if valido

	      	if @torneo.destroy

SELECT  "torneos".* FROM "torneos"  WHERE "torneos"."id" = $1 LIMIT 1  [["id", 1]]
---
	  def editar

	    @torneo = Torneo.find(params[:id])

SELECT  "torneos".* FROM "torneos"  WHERE "torneos"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "torneos" SET "cantidad_fechas" = $1, "descripcion" = $2, "updated_at" = $3 WHERE "torneos"."id" = 1  [["cantidad_fechas", "2022.0"], ["descripcion", "CAMPEONATO CENTRAL MX/VX"], ["updated_at", "2022-01-11 02:36:43.683496"]]
---
	def actualizar

	    valido = true
	    @msg = ""

	    @torneo = Torneo.find(params[:torneo][:id])
	    auditoria_id = auditoria_antes("actualizar torneo", "torneos", @torneo)

	    if valido


	    	@torneo.descripcion = params[:torneo][:descripcion].upcase
	    	@torneo.cantidad_fechas = params[:torneo][:cantidad_fechas]
	    	@torneo.fecha = params[:torneo][:fecha]

	      	if @torneo.save