app/controllers/usuarios_controller.rb

  def cambiar_perfil_actual

    current_usuario.perfil_actual_id = params[:perfil_id]
    current_usuario.save
---
UPDATE "usuarios" SET "last_request_at" = $1, "perishable_token" = $2, "updated_at" = $3 WHERE "usuarios"."id" = 28936  [["last_request_at", "2022-01-10 01:55:00.523854"], ["perishable_token", "RaREkrP5kQZCeTLBVClo"], ["updated_at", "2022-01-10 01:55:00.526246"]]